Autodesk.Navisworks.Api.ViewRedrawRequests
Flags specifying which sorts of redraw are requested.

Autodesk.Navisworks.Api.ViewRedrawRequests.None
No redraw requested unless other flags specified.

Autodesk.Navisworks.Api.ViewRedrawRequests.Render
Main Render requested.

Autodesk.Navisworks.Api.ViewRedrawRequests.OverlayRender
Overlay Render requested.

Autodesk.Navisworks.Api.ViewRedrawRequests.All
Main Render and Overlay Render requested.